rpi.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Raspberry Pi short reference</title>
<!-- 2018-03-31 Sat 16:21 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Tina Dijkshoorn" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>


</head>
<body>
<div id="content">
<h1 class="title">Raspberry Pi short reference</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Make SD disk - MAC OS X</a></li>
<li><a href="#sec-2">Roms</a>
<ul>
<li><a href="#sec-2-1">Option 1: the hackers way</a></li>
<li><a href="#sec-2-2">Option 2: the Noob way</a></li>
</ul>
</li>
<li><a href="#sec-3">Configure SD for the first installation</a></li>
<li><a href="#sec-4">Initial Setup</a></li>
<li><a href="#sec-5">Network</a>
<ul>
<li><a href="#sec-5-1">Cable</a></li>
<li><a href="#sec-5-2">WIFI</a></li>
<li><a href="#sec-5-3">Multiple networks</a></li>
<li><a href="#sec-5-4">Network problems</a></li>
</ul>
</li>
<li><a href="#sec-6">commands</a>
<ul>
<li><a href="#sec-6-1">Simple Unix commands</a></li>
<li><a href="#sec-6-2">Handy commands</a></li>
</ul>
</li>
<li><a href="#sec-7">Talk with:</a>
<ul>
<li><a href="#sec-7-1">Another hard disk</a></li>
<li><a href="#sec-7-2">AFP: Apple talk</a></li>
<li><a href="#sec-7-3">Windows by Samba</a></li>
<li><a href="#sec-7-4">Video Web cam</a></li>
</ul>
</li>
<li><a href="#sec-8">VNC  remote desktop</a></li>
<li><a href="#sec-9">Apache webserver</a></li>
<li><a href="#sec-10">MotionPi: use the camera for spying or for video</a></li>
<li><a href="#sec-11">Sound</a></li>
<li><a href="#sec-12">Node-RED</a></li>
<li><a href="#sec-13">Install database mongo</a></li>
<li><a href="#sec-14">On the Apple</a>
<ul>
<li><a href="#sec-14-1">Connect to SD card</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Make SD disk - MAC OS X</h2>
<div class="outline-text-2" id="text-1">
<p>
The SD card contains the OS and all files
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Roms</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://volumio.org/get-started/">https://volumio.org/get-started/</a>
<a href="https://github.com/volumio/Volumio2">https://github.com/volumio/Volumio2</a>
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Option 1: the hackers way</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-org">df -h
unzip ~/Downloads/2012-12-16-wheezy-raspbian.zip

diskutil list    //find the correct /dev/diskx
diskutil unmountDisk /dev/disk2 

sudo dd bs=1m if=~/Downloads/2012-10-28-wheezy-raspbian/2012-12-16-wheezy-raspbian.img of=/dev/disk1

sudo dd bs=1m if=~/Downloads/2017-03-02-raspbian-jessie.img of=/dev/disk2

CTRL T gives information about process

diskutil mountDisk /dev/diskx
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Option 2: the Noob way</h3>
<div class="outline-text-3" id="text-2-2">
<p>
format disk met SDFormat option full
</p>

<p>
copy NOOB files on disk
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Configure SD for the first installation</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Place an empty file <code>ssh</code> in the root path in order to get ssh access
</li>
<li>edit <code>wpa_supplicant.conf</code> add (file is removed after booting): 
<div class="org-src-container">

<pre class="src src-org">ctrl_interface=DIR=/var/run/wpa_supplicant GROUP=netdev
update_config=1
network={
ssid="WIFI"
psk="Mysecret4"
scan_ssid=1
}
</pre>
</div>
</li>
<li>edit <code>config.txt</code> and add:
<div class="org-src-container">

<pre class="src src-org">#Enable UART
enable_uart=1
</pre>
</div>
</li>
<li>boot and login with 
<div class="org-src-container">

<pre class="src src-org">ssh pi@rasberry.local password raspberry
</pre>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Initial Setup</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-org">sudo raspi-config     // config screen
sudo apt-get update   // install new versions of software fetch the package list
sudo apt-get upgrade  // will fetch new versions of packages existing on the machine
sudo apt-get dist-upgrade  //same as upgrade but also dependencies
reboot
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Network</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">Cable</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">

<pre class="src src-org">sudo nano /etc/network/interfaces   

iface eth0 inet static //static 
 address 192.168.1.2 
 netmask 255.255.255.0 
 gateway 192.168.1.1
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">WIFI</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">

<pre class="src src-org">iface eth0 inet dhcp    //DHCP
allow-hotplug wlan0         //wifi
iface wlan0 inet dhcp
wpa-roam /etc/wpa_supplicant/wpa_supplicant.conf



sudo more /etc/wpa_supplicant/wpa_supplicant.conf

ctrl_interface=DIR=/var/run/wpa_supplicant GROUP=netdev
update_config=1
network={
ssid="NAMEWIFIROUTER"
proto=RSN
key_mgmt=WPA-PSK
pairwise=CCMP TKIP
group=CCMP TKIP
psk="password"
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3">Multiple networks</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Edit <code>/etc/wpa_supplicant/wpa_supplicant.conf</code>
</p>
<div class="org-src-container">

<pre class="src src-org">ctrl_interface=DIR=/var/run/wpa_supplicant GROUP=netdev
update_config=1

network={
    ssid="SCHOOLS NETWORK NAME"
    psk="SCHOOLS PASSWORD"
    id_str="school"
}

network={
    ssid="HOME NETWORK NAME"
    psk="HOME PASSWORD"
    id_str="home"
}


/etc/network/interfaces
auto lo

iface lo inet loopback
iface eth0 inet dhcp

allow-hotplug wlan0
iface wlan0 inet manual
wpa-roam /etc/wpa_supplicant/wpa_supplicant.conf

iface school inet static
address 
gateway 
netmask 

iface home inet static
address 
gateway 
netmask
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4">Network problems</h3>
<div class="outline-text-3" id="text-5-4">
<ol class="org-ol">
<li>Check that the hardware is connected (lights on both ends) or with iwconfig wlan0 (for WiFi)
</li>
<li>Check that the kernel can see the hardware with:
<div class="org-src-container">

<pre class="src src-org">ifconfig -a
</pre>
</div>
</li>

<li>Check that you active interface has an IP address 
<div class="org-src-container">

<pre class="src src-org">ifconfig eth0 
ifconfig wlan0
</pre>
</div>
</li>

<li>Check the kernel routing table 
<div class="org-src-container">

<pre class="src src-org">route -n (or ip route)
sudo route add default gw 192.168.2.1 wlan0
</pre>
</div>
</li>

<li>Check you can ping your gateway (you get the gateway address from the route command)
<div class="org-src-container">

<pre class="src src-org">ping 192.168.2.1
</pre>
</div>
</li>
<li>Check you can ping 8.8.8.8 (Google's DNS server)
<div class="org-src-container">

<pre class="src src-org">ping 8.8.8.8
</pre>
</div>
</li>
<li>Check you can resolve host names (ping google.com)
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">commands</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1">Simple Unix commands</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">

<pre class="src src-org">ls            //list files
pwd
which  pwd    //where is my pwd command
lsusb         //show USB devices
cp   file1 file2    // copy
mv   file1 file3    // rename of move
df -h               // show mounted filesystems
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2">Handy commands</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">

<pre class="src src-org">sudo nano /etc/hostname 
sudo nano /etc/hosts 
 sudo reboot    //reboot
sudo halt      //stop
 sudo adduser john         // make new user
sudo adduser john sudo    // make user sudo
sudo nano /etc/sudoers
 sudo fdisk -l             // show attached drives
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Talk with:</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1">Another hard disk</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">

<pre class="src src-org">sudo apt-get install ntfs-3g   //install Read NTFS 
sudo apt-get install hfsplus
sudo blkid                // show all 
nano /etc/fstab           // mount at start up
/dev/sd       /mnt/data       ntfs    defaults        0       0
sudo mount -a
</pre>
</div>
<p>
 
</p>
</div>
</div>
<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2">AFP: Apple talk</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">

<pre class="src src-org">sudo apt-get install netatalk
in Finder hit ⌘K. Enter afp://192.168.2.150
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3">Windows by Samba</h3>
<div class="outline-text-3" id="text-7-3">
<div class="org-src-container">

<pre class="src src-org">sudo apt-get update
sudo apt-get install samba
sudo apt-get install samba samba-common-bin
nano /etc/samba/smb.conf        //edit config file 
sudo service samba restart      //iedere keer als je iets veranderd

[global]
workgroup = workgroup
server string = %h
wins support = no
dns proxy = no
security = share
encrypt passwords = yes
panic action = /usr/share/samba/panic-action %d

[sites]
path = /mnt/data
writeable = yes
broweable = yes
read only = no
guest ok = yes
force user = root

sudo smbpasswd -a john             //add samba user 
sudo mkdir /mnt/data
sudo chmod 777 /mnt/data
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-4" class="outline-3">
<h3 id="sec-7-4">Video Web cam</h3>
<div class="outline-text-3" id="text-7-4">
<div class="org-src-container">

<pre class="src src-org">sudo apt-get install motion
sudo nano /etc/motion/motion.conf
daemon  ON
webcam_localhost  OFF
sudo service motion start
sudo nano /etc/default/motion 
http://192.168.2.111:8081

sudo apt-get install python-opencv
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">VNC  remote desktop</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">

<pre class="src src-org">apt-get install tightvncserver
tightvncserver
vncpasswd
vncserver :1 -geometry 800x600 -depth 24

if server is started on 1 this means port 5901
in finder (connect icon)  vnc://192.168.2.70:5901
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">Apache webserver</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">

<pre class="src src-org">sudo apt-get install apache2
sudo nano /etc/apache2/sites-enabled/000-default 
AddHandler cgi-script .py 
sudo chmod 777 /usr/lib/cgi-bin/test.py
</pre>
</div>

<p>
special raspberry ROM's / images:
</p>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">MotionPi: use the camera for spying or for video</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">

<pre class="src src-org">ssh root@192.168.2.181
use password after the dash name router

use find to find IP adres of the raspberry 
Safari: 192.168.2.1
admin ; no password
use vi for editing files 
set wifi password and SIID of the router in /data/etc/wpa_ ...
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">Sound</h2>
<div class="outline-text-2" id="text-11">
<div class="org-src-container">

<pre class="src src-org">sudo apt-get install alsa-utils
sudo apt-get install mpg321
sudo apt-get install lame
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">Node-RED</h2>
<div class="outline-text-2" id="text-12">
<p>
<a href="https://nodered.org/docs/hardware/raspberrypi">https://nodered.org/docs/hardware/raspberrypi</a>
(curl -sL <a href="https://raw.githubusercontent.com/node-red/raspbian-deb-package/master/resources/update-nodejs-and-nodered">https://raw.githubusercontent.com/node-red/raspbian-deb-package/master/resources/update-nodejs-and-nodered</a>)
</p>

<p>
node-red-start
</p>

<p>
In safari <code>192.168.2.70:1880</code>
</p>

<div class="org-src-container">

<pre class="src src-org">npm install node-red-node-mongodb
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13">Install database mongo</h2>
<div class="outline-text-2" id="text-13">
<div class="org-src-container">

<pre class="src src-org">sudo apt-get install mongodb-server
sudo nano /etc/mongodb.conf             //edit config paths 
/var/log/mongod                       // look into the logs
mongod                                // start server
mongod --dbpath /data/db --repair     // repair if RPi shutdown un
mongo
show dbs                              // show databases
use Mydb
show collections                      // show collections
db.createCollection(“my collection”)  // Make a collection
db.mycollection.remove()              // remove collection

db.addUser( { user: "joe",
... pwd: "secret",
... roles: [ "readWrite", "dbAdmin" ]
... } )
http://192.168.2.70:28017             //Webinterface
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14">On the Apple</h2>
<div class="outline-text-2" id="text-14">
</div><div id="outline-container-sec-14-1" class="outline-3">
<h3 id="sec-14-1">Connect to SD card</h3>
<div class="outline-text-3" id="text-14-1">
<p>
+Find the  the partition indentifier on the disk
+Create a mount point
+Mount the SD Card
</p>

<div class="org-src-container">

<pre class="src src-org">diskutil list
sudo mkdir /Volumes/raspberry
sudo ext4fuse /dev/disk2s2 /Volumes/raspberry -o allow_other
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tina Dijkshoorn</p>
<p class="date">Created: 2018-03-31 Sat 16:21</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
